---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RailingSystemSecondaryHandrailsTypesParam
source: html/eac88a69-145c-1717-c4e1-55f1e8652c86.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RailingSystemSecondaryHandrailsTypesParam Property

"Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RailingSystemSecondaryHandrailsTypesParam { get; }
```